zmzdh/CAN_st_test/Drivers/FM33FG0xxA_FL_Driver/Src/fm33fg0xxa_fl_uart.c
 /**    
  *******************************************************************************************************
  * @file    fm33fg0xxa_fl_uart.c
  * @author  FMSH Application Team
  * @brief   Source file of UART FL Module
  *******************************************************************************************************  
  * @attention    
  * Copyright (c) 2023, SHANGHAI FUDAN MICROELECTRONICS GROUP CO., LTD.(FUDAN MICROELECTRONICS./ FUDAN MICRO.)    
  * All rights reserved.    
  *    
  * Processor:                   FM33FG0xxA    
  * http:                        http://www.fmdevelopers.com.cn/    
  *    
  * Redistribution and use in source and binary forms, with or without    
  * modification, are permitted provided that the following conditions are met    
  *    
  * 1. Redistributions of source code must retain the above copyright notice,    
  *    this list of conditions and the following disclaimer.    
  *    
  * 2. Redistributions in binary form must reproduce the above copyright notice,    
  *    this list of conditions and the following disclaimer in the documentation    
  *    and/or other materials provided with the distribution.    
  *    
  * 3. Neither the name of the copyright holder nor the names of its contributors    
  *    may be used to endorse or promote products derived from this software    
  *    without specific prior written permission.    
  *    
  * 4. To provide the most up-to-date information, the revision of our documents     
  *    on the World Wide Web will be the most Current. Your printed copy may be      
  *    an earlier revision. To verify you have the latest information avaliable,    
  *    refer to: http://www.fmdevelopers.com.cn/.    
  *    
  * THIS SOFTWARE IS PROVIDED BY FUDAN MICRO "AS IS" AND ANY EXPRESSED:     
  * ORIMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES     
  * OF MERCHANTABILITY NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE    
  * ARE DISCLAIMED.IN NO EVENT SHALL FUDAN MICRO OR ITS CONTRIBUTORS BE LIABLE     
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL     
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS     
  * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER    
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,     
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISINGIN ANY WAY OUT OF THE     
  * USE OF THIS SOFTWARE, EVEN IF ADVISED OFTHE POSSIBILITY OF SUCH DAMAGE.    
  *
  *******************************************************************************************************
  */    

/* Includes ------------------------------------------------------------------*/
#include "fm33fg0xxa_fl.h"

/** @addtogroup FM33FG0XXA_FL_Driver
  * @{
  */

/* Private macros ------------------------------------------------------------*/
/** @addtogroup UART_FL_Private_Macros
  * @{
  */


#define     IS_UART_INSTANCE(INSTANCE)                     (((INSTANCE) == UART0)||\
                                                            ((INSTANCE) == UART1)||\
                                                            ((INSTANCE) == UART2)||\
                                                            ((INSTANCE) == UART3)||\
                                                            ((INSTANCE) == UART4)||\
                                                            ((INSTANCE) == UART5))
                                                           
#define     IS_FL_UART_CLKSRC(__VALUE__)                   (((__VALUE__) == FL_CMU_UART0_CLK_SOURCE_APBCLK)||\
                                                            ((__VALUE__) == FL_CMU_UART0_CLK_SOURCE_RCHF)||\
                                                            ((__VALUE__) == FL_CMU_UART0_CLK_SOURCE_SYSCLK)||\
                                                            ((__VALUE__) == FL_CMU_UART0_CLK_SOURCE_XTHF)||\
                                                            ((__VALUE__) == FL_CMU_UART1_CLK_SOURCE_APBCLK)||\
                                                            ((__VALUE__) == FL_CMU_UART1_CLK_SOURCE_RCHF)||\
                                                            ((__VALUE__) == FL_CMU_UART1_CLK_SOURCE_SYSCLK)||\
                                                            ((__VALUE__) == FL_CMU_UART1_CLK_SOURCE_XTHF))
                                                           
                                                           
#define     IS_FL_UART_DATAWIDTH(__VALUE__)                (((__VALUE__) == FL_UART_DATA_WIDTH_6B)||\
                                                            ((__VALUE__) == FL_UART_DATA_WIDTH_7B)||\
                                                            ((__VALUE__) == FL_UART_DATA_WIDTH_8B)||\
                                                            ((__VALUE__) == FL_UART_DATA_WIDTH_9B))
                                                           
#define     IS_FL_UART_STOPBITS(__VALUE__)                 (((__VALUE__) == FL_UART_STOP_BIT_WIDTH_1B)||\
                                                            ((__VALUE__) == FL_UART_STOP_BIT_WIDTH_2B))
                                                           
#define     IS_FL_UART_PARITY(__VALUE__)                   (((__VALUE__) == FL_UART_PARITY_NONE)||\
                                                            ((__VALUE__) == FL_UART_PARITY_EVEN)||\
                                                            ((__VALUE__) == FL_UART_PARITY_ODD))
                                                           
#define     IS_FL_UART_DIRECTION(__VALUE__)                (((__VALUE__) == FL_UART_DIRECTION_NONE)||\
                                                            ((__VALUE__) == FL_UART_DIRECTION_RX)||\
                                                            ((__VALUE__) == FL_UART_DIRECTION_TX)||\
                                                            ((__VALUE__) == FL_UART_DIRECTION_TX_RX))
                                                           
